department/load.yml
config:
  target: "https://onpremise-elegislative-frontend.cloudmateria.com/"
  phases:
    # Ramp-Up Phase: Start with small traffic and gradually increase.
    - duration: 300               # 5 minutes ramp-up
      arrivalRate: 5              # Start with 5 users/sec
      rampTo: 50                  # Ramp up to 50 users/sec over 5 minutes

    # Steady Load Phase: Simulate a steady load of 100 users/sec for 30 minutes.
    - duration: 1800              # 30 minutes of steady load
      arrivalRate: 50             # Sustained 50 users/sec, simulating ~200 concurrent users

    # Peak Load Phase: Simulate a peak load of 100 users/sec for 10 minutes.
    - duration: 600               # 10 minutes of peak load
      arrivalRate: 100            # Ramp up to 100 users/sec

    # Ramp-Down Phase: Gradually reduce load to normal.
    - duration: 300               # 5 minutes ramp-down
      arrivalRate: 20             # Reduce to 20 users/sec over the last phase

  tls:
    rejectUnauthorized: false

scenarios:
  - name: "Department Load Test on /"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
          think: 1  # Think time between requests to simulate user behavior