department/stress.yml
config:
  target: "https://example.com"
  phases:
    # Ramp-Up Phase: Gradually increase traffic to simulate user buildup.
    - duration: 300               # 5 minutes ramp-up
      arrivalRate: 5              # Start with 5 users/sec
      rampTo: 50                  # Ramp up to 50 users/sec over 5 minutes

    # Peak Load Phase: Simulate high traffic for 10 minutes at 500 users/sec.
    - duration: 600               # 10 minutes of peak load
      arrivalRate: 500            # Sustained 500 users/sec for 10 minutes (stress)

    # Sudden Spike Phase: Simulate an extreme traffic spike for 5 minutes.
    - duration: 300               # 5 minutes of intense stress
      arrivalRate: 1000           # Spike to 1000 users/sec

    # Ramp-Down Phase: Gradually reduce load to normal.
    - duration: 300               # 5 minutes ramp-down
      arrivalRate: 50             # Reduce to 50 users/sec

  tls:
    rejectUnauthorized: false

scenarios:
  - name: "Department Stress Test on /"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
          think: 1  # Think time to simulate real user behavior